Repository: GabrielGrabalos/MyHabitStreak
Catalog: *_habit_streak/lib/l10n/app_*.arb
Languages: de, es, fr, ja, pt, ru, zh

# language
source: English
de: Deutsch
es: Español
fr: Français
ja: 日本語
pt: Português
ru: Русский
zh: 中文

# idiom
source: Language
de: Sprache
es: Idioma
fr: Langue
ja: 言語
pt: Idioma
ru: Язык
zh: 语言

source: Privacy Policy
de: Datenschutzrichtlinie
es: Política de Privacidad
fr: Politique de Confidentialité
ja: プライバシーポリシー
pt: Política de Privacidade
ru: Политика Конфиденциальности
zh: 隐私政策

# appTitle
source: My Habit Streak
de: Meine Gewohnheits-Serie
es: Mi Racha de Hábitos
fr: Ma Série d'Habitudes
ja: マイ習慣ストリーク
pt: Meus Hábitos
ru: Мой Трекер Привычек
zh: 我的习惯打卡

source: Create Habit
de: Gewohnheit erstellen
es: Crear Hábito
fr: Créer une Habitude
ja: 習慣を作成
pt: Criar Hábito
ru: Создать Привычку
zh: 创建习惯

source: Edit Habit
de: Gewohnheit bearbeiten
es: Editar Hábito
fr: Modifier l'Habitude
ja: 習慣を編集
pt: Editar Hábito
ru: Редактировать Привычку
zh: 编辑习惯

source: Habit Title
de: Gewohnheitstitel
es: Título del Hábito
fr: Titre de l'Habitude
ja: 習慣のタイトル
pt: Título do Hábito
ru: Название Привычки
zh: 习惯标题

source: Description
de: Beschreibung
es: Descripción
ja: 説明
pt: Descrição
ru: Описание
zh: 描述

# noDescription
source: No description provided.
de: Keine Beschreibung vorhanden.
es: No se proporcionó descripción.
fr: Aucune description fournie.
ja: 説明がありません。
pt: Nenhuma descrição fornecida.
ru: Описание отсутствует.
zh: 未提供描述。

source: Save Habit
de: Gewohnheit speichern
es: Guardar Hábito
fr: Enregistrer l'Habitude
ja: 習慣を保存
pt: Salvar Hábito
ru: Сохранить Привычку
zh: 保存习惯

source: Delete Habit
de: Gewohnheit löschen
es: Eliminar Hábito
fr: Supprimer l'Habitude
ja: 習慣を削除
pt: Excluir Hábito
ru: Удалить Привычку
zh: 删除习惯

# markDone
source: Mark as done
de: Als erledigt markieren
es: Marcar como hecho
fr: Marquer comme fait
ja: 完了としてマーク
pt: Marcar como feito
ru: Отметить как выполненное
zh: 标记为完成

# markNotDone
source: Mark as not done
de: Als nicht erledigt markieren
es: Marcar como no hecho
fr: Marquer comme non fait
ja: 未完了としてマーク
pt: Marcar como não feito
ru: Отметить как невыполненное
zh: 标记为未完成

# streakHistory
source: Your streak history
de: Ihre Serienhistorie
es: Tu historial de rachas
fr: Votre historique de séries
ja: ストリーク履歴
pt: Seu histórico de sequências
ru: История ваших серий
zh: 您的打卡历史

source: Invalid Habit
de: Ungültige Gewohnheit
es: Hábito Inválido
fr: Habitude Invalide
ja: 無効な習慣
pt: Hábito Inválido
ru: Недействительная Привычка
zh: 无效习惯

# invalidHabitMessage
source: Please ensure the habit title is not empty and is unique.
de: Bitte stellen Sie sicher, dass der Gewohnheitstitel nicht leer und eindeutig ist.
es: Por favor, asegúrese de que el título del hábito no esté vacío y sea único.
fr: Veuillez vérifier que le titre de l'habitude n'est pas vide et qu'il est unique.
ja: 習慣のタイトルが空でなく、一意であることを確認してください。
pt: Por favor, verifique se o título do hábito não está vazio e é único.
ru: Пожалуйста, убедитесь, что название привычки не пустое и уникальное.
zh: 请确保习惯标题不为空且唯一。

# deleteConfirmationTitle
source: Delete Habit?
de: Gewohnheit löschen?
es: ¿Eliminar hábito?
fr: Supprimer l'Habitude ?
ja: 習慣を削除しますか？
pt: Excluir Hábito?
ru: Удалить Привычку?
zh: 删除习惯？

# deleteConfirmationMessage
source: Are you sure you want to delete this habit? This action cannot be undone.
de: Sind Sie sicher, dass Sie diese Gewohnheit löschen möchten? Diese Aktion kann nicht rückgängig gemacht werden.
es: ¿Está seguro de que desea eliminar este hábito? Esta acción no se puede deshacer.
fr: Êtes-vous sûr de vouloir supprimer cette habitude ? Cette action ne peut pas être annulée.
ja: この習慣を削除してもよろしいですか？この操作は元に戻せません。
pt: Tem certeza de que deseja excluir este hábito? Esta ação não pode ser desfeita.
ru: Вы уверены, что хотите удалить эту привычку? Это действие нельзя отменить.
zh: 确定要删除此习惯吗？此操作无法撤消。

# markDoneConfirmation
source: Mark as done?
de: Als erledigt markieren?
es: ¿Marcar como hecho?
fr: Marquer comme fait ?
ja: 完了としてマークしますか？
pt: Marcar como feito?
ru: Отметить как выполненное?
zh: 标记为完成？

# markNotDoneConfirmation
source: Mark as not done?
de: Als nicht erledigt markieren?
es: ¿Marcar como no hecho?
fr: Marquer comme non fait ?
ja: 未完了としてマークしますか？
pt: Marcar como não feito?
ru: Отметить как невыполненное?
zh: 标记为未完成？

# markDoneMessage
source: Are you sure you want to mark this habit as done? Remember, we're here to help. Don't lie to yourself!
de: Sind Sie sicher, dass Sie diese Gewohnheit als erledigt markieren möchten? Denken Sie daran, wir sind hier, um zu helfen. Lügen Sie sich nicht selbst an!
es: ¿Está seguro de que desea marcar este hábito como hecho? Recuerde, estamos aquí para ayudar. ¡No se mienta a sí mismo!
fr: Êtes-vous sûr de vouloir marquer cette habitude comme faite ? N'oubliez pas, nous sommes là pour vous aider. Ne vous mentez pas à vous-même !
ja: この習慣を完了としてマークしますか？ ご注意ください、私たちはあなたを助けるためにここにいます。自分に嘘をつかないでください！
pt: Tem certeza de que deseja marcar este hábito como feito? Lembre-se, estamos aqui para ajudar. Não minta para si mesmo!
ru: Вы уверены, что хотите отметить эту привычку как выполненную? Помните, мы здесь, чтобы помочь. Не обманывайте себя!
zh: 确定要将此习惯标记为完成吗？ 记住，我们在此帮助您。不要欺骗自己！

# markNotDoneMessage
source: Are you sure you want to mark this habit as not done?
de: Sind Sie sicher, dass Sie diese Gewohnheit als nicht erledigt markieren möchten?
es: ¿Está seguro de que desea marcar este hábito como no hecho?
fr: Êtes-vous sûr de vouloir marquer cette habitude comme non faite ?
ja: この習慣を未完了としてマークしますか？
pt: Tem certeza de que deseja marcar este hábito como não feito?
ru: Вы уверены, что хотите отметить эту привычку как невыполненную?
zh: 确定要将此习惯标记为未完成吗？

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
ja: キャンセル
pt: Cancelar
ru: Отмена
zh: 取消

source: Confirm
de: Bestätigen
es: Confirmar
fr: Confirmer
ja: 確認
pt: Confirmar
ru: Подтвердить
zh: 确认

source: My Habits
de: Meine Gewohnheiten
es: Mis Hábitos
fr: Mes Habitudes
ja: マイ習慣
pt: Meus Hábitos
ru: Мои Привычки
zh: 我的习惯

source: Not Done Today
de: Heute nicht erledigt
es: No Hecho Hoy
fr: Pas Fait Aujourd'hui
ja: 今日未完了
pt: Não Feito Hoje
ru: Не Выполнено Сегодня
zh: 今日未完成

source: Done Today
de: Heute erledigt
es: Hecho Hoy
fr: Fait Aujourd'hui
ja: 今日完了
pt: Feito Hoje
ru: Выполнено Сегодня
zh: 今日已完成

# startCreating
source: Start by creating a new habit!
de: Beginnen Sie mit dem Erstellen einer neuen Gewohnheit!
es: ¡Comience creando un nuevo hábito!
fr: Commencez par créer une nouvelle habitude !
ja: 新しい習慣を 作成しましょう！
pt: Comece criando um novo hábito!
ru: Начните с создания новой привычки!
zh: 开始创建 新习惯！

# testNotificationTitle
source: Test Notification
de: Testbenachrichtigung
es: Notificación de Prueba
fr: Notification de Test
ja: テスト通知
pt: Notificação de Teste
ru: Тестовое уведомление
zh: 测试通知

# testNotificationBody
source: This is a test notification scheduled to appear 1 minute after setup
de: Dies ist eine Testbenachrichtigung, die 1 Minute nach dem Setup erscheint
es: Esta es una notificación de prueba programada para aparecer 1 minuto después de la configuración
fr: Ceci est une notification de test programmée pour apparaître 1 minute après la configuration
ja: これはセットアップ1分後に表示されるテスト通知です
pt: Esta é uma notificação de teste agendada para aparecer 1 minuto após a configuração
ru: Это тестовое уведомление появится через 1 минуту после настройки
zh: 这是一个测试通知，将在设置后1分钟出现

source: Good Morning!
de: Guten Morgen!
es: ¡Buenos Días!
fr: Bonjour !
ja: おはようございます！
pt: Bom Dia!
ru: Доброе утро!
zh: 早上好！

source: Midday Check-in
de: Mittags-Check-in
es: Registro del Mediodía
fr: Point de Mi-journée
ja: 昼のチェックイン
pt: Check-in do Meio Dia
ru: Проверка в полдень
zh: 中午检查

source: Evening Update
de: Abendupdate
es: Actualización de la Tarde
fr: Mise à Jour du Soir
ja: 夕方の更新
pt: Atualização da Tarde
ru: Вечернее обновление
zh: 晚间更新

source: Nightly Reflection
de: Nächtliche Reflexion
es: Reflexión Nocturna
fr: Réflexion Nocturne
ja: 夜の振り返り
pt: Reflexão Noturna
ru: Вечерняя рефлексия
zh: 夜间反思

source: Final Reminder
de: Letzte Erinnerung
es: Recordatorio Final
fr: Rappel Final
ja: 最終リマインダー
pt: Lembrete Final
ru: Последнее напоминание
zh: 最终提醒

# morningHabitCheck
source: Time to check your habits for the day
de: Zeit, deine Gewohnheiten für den Tag zu überprüfen
es: Hora de revisar tus hábitos del día
fr: Il est temps de vérifier vos habitudes du jour
ja: 今日の習慣を確認する時間です
pt: Hora de verificar seus hábitos do dia
ru: Пора проверить ваши привычки на день
zh: 该检查你今天的习惯了

# middayProgress
source: How are your habits progressing?
de: Wie laufen deine Gewohnheiten?
es: ¿Cómo van tus hábitos?
fr: Comment vont vos habitudes ?
ja: 習慣の進捗はいかがですか？
pt: Como estão seus hábitos?
ru: Как продвигаются ваши привычки?
zh: 你的习惯进展如何？

# eveningReview
source: Time to review your daily habits
de: Zeit, deine täglichen Gewohnheiten zu überprüfen
es: Hora de revisar tus hábitos diarios
fr: Il est temps de revoir vos habitudes quotidiennes
ja: 毎日の習慣を振り返る時間です
pt: Hora de revisar seus hábitos diários
ru: Пора пересмотреть ваши ежедневные привычки
zh: 该回顾你的日常习惯了

# dailyPerformance
source: How did you do with your habits today?
de: Wie bist du heute mit deinen Gewohnheiten zurechtgekommen?
es: ¿Cómo te fue con tus hábitos hoy?
fr: Comment avez-vous géré vos habitudes aujourd'hui ?
ja: 今日の習慣はどうでしたか？
pt: Como você foi com seus hábitos hoje?
ru: Как у вас сегодня с привычками?
zh: 今天你的习惯完成得怎么样？

# lastChance
source: Last chance to complete your habits today
de: Letzte Chance, deine Gewohnheiten heute abzuschließen
es: Última oportunidad para completar tus hábitos hoy
fr: Dernière chance de terminer vos habitudes aujourd'hui
ja: 今日の習慣を完了する最後の機会です
pt: Última chance para completar seus hábitos hoje
ru: Последний шанс выполнить ваши привычки сегодня
zh: 完成今天的习惯的最后机会

# progressComplete
source: Today's progress: {progress}% complete
de: Heutiger Fortschritt: {progress}% abgeschlossen
es: Progreso de hoy: {progress}% completo
fr: Progrès du jour : {progress}% terminé
ja: 今日の進捗: {progress}% 完了
pt: Progresso de hoje: {progress}% completo
ru: Сегодняшний прогресс: {progress}% завершено
zh: 今日进度：{progress}% 完成

# habitsDone
source: {completed} of {total} habits done
de: {completed} von {total} Gewohnheiten erledigt
es: {completed} de {total} hábitos realizados
fr: {completed} sur {total} habitudes faites
ja: {completed}/{total} の習慣を完了
pt: {completed} de {total} hábitos concluídos
ru: {completed} из {total} привычек выполнено
zh: 完成 {completed} 个习惯，共 {total} 个

# motivationStart
source: You've got this! Start with one small habit.
de: Du schaffst das! Beginne mit einer kleinen Gewohnheit.
es: ¡Tú puedes! Empieza con un pequeño hábito.
fr: Vous avez ça ! Commencez par une petite habitude.
ja: あなたならできます！小さな習慣から始めましょう。
pt: Você consegue! Comece com um pequeno hábito.
ru: У вас получится! Начните с одной маленькой привычки.
zh: 你能行！从一个小的习惯开始。

# motivationKeepGoing
source: Keep going! Every habit counts.
de: Weiter so! Jede Gewohnheit zählt.
es: ¡Sigue adelante! Cada hábito cuenta.
fr: Continuez ! Chaque habitude compte.
ja: 続けてください！すべての習慣が重要です。
pt: Continue! Cada hábito conta.
ru: Продолжайте! Каждая привычка имеет значение.
zh: 继续加油！每一个习惯都很重要。

# motivationGreatProgress
source: Great progress! Finish strong!
de: Toller Fortschritt! Beende es stark!
es: ¡Gran progreso! ¡Termina fuerte!
fr: Super progression ! Terminez en force !
ja: 素晴らしい進捗です！最後まで頑張ってください！
pt: Ótimo progresso! Termine com força!
ru: Отличный прогресс! Заканчивайте сильно!
zh: 进展不错！坚持完成！

# motivationAmazing
source: Amazing! You completed all your habits today!
de: Erstaunlich! Du hast heute alle deine Gewohnheiten erledigt!
es: ¡Increíble! ¡Completaste todos tus hábitos hoy!
fr: Incroyable ! Vous avez terminé toutes vos habitudes aujourd'hui !
ja: すごい！今日はすべての習慣を完了しました！
pt: Incrível! Você completou todos os seus hábitos hoje!
ru: Удивительно! Вы выполнили все свои привычки сегодня!
zh: 太棒了！你今天完成了所有的习惯！

# notificationsTitle
source: Notifications
de: Benachrichtigungen
es: Notificaciones
ja: 通知
pt: Notificações
ru: Уведомления
zh: 通知

# notificationsMessage
source: Allow us to send you some notifications to help you never forget about your new habits! We promise not to abuse it!
de: Erlaube uns, dir Benachrichtigungen zu senden, damit du deine neuen Gewohnheiten nie vergisst! Wir versprechen, es nicht zu missbrauchen!
es: ¡Permítenos enviarte notificaciones para ayudarte a nunca olvidar tus nuevos hábitos! ¡Prometemos no abusar!
fr: Autorisez-nous à vous envoyer des notifications pour ne jamais oublier vos nouvelles habitudes ! Nous promettons de ne pas en abuser !
ja: 新しい習慣を忘れないように通知を送信することを許可してください！乱用しないことを約束します！
pt: Permita-nos enviar notificações para ajudá-lo a nunca esquecer seus novos hábitos! Prometemos não abusar!
ru: Разрешите нам отправлять уведомления, чтобы помочь вам не забывать о новых привычках! Обещаем не злоупотреблять!
zh: 请允许我们向您发送通知，帮助您永不忘记新习惯！我们保证不会滥用！

# permanentlyDeniedMessage
source: Are you sure you want to permanently deny notifications?
de: Möchten Sie Benachrichtigungen dauerhaft ablehnen?
es: ¿Estás seguro de que deseas denegar permanentemente las notificaciones?
fr: Êtes-vous sûr de vouloir refuser définitivement les notifications ?
ja: 通知を永久に拒否してもよろしいですか？
pt: Tem certeza que deseja negar permanentemente as notificações?
ru: Вы уверены, что хотите навсегда отключить уведомления?
zh: 您确定要永久拒绝通知吗？

source: Open Settings
de: Einstellungen öffnen
es: Abrir Ajustes
fr: Ouvrir les Paramètres
ja: 設定を開く
pt: Abrir Configurações
ru: Открыть настройки
zh: 打开设置

source: Don't ask again
de: Nicht mehr fragen
es: No volver a preguntar
fr: Ne plus demander
ja: 再び確認しない
pt: Não perguntar novamente
ru: Не спрашивать снова
zh: 不再询问
